#структурный (гл) сапорт аспектный
———————————————
prompt = "напиши очень кратко что нужно раскрыть, написать в данном реферате (" + text + ") имеющем данную структуру (" + ll2 + ") так чтобы реферат был содержательным и взаимосвязанным напиши только 15 ключевых аспектов"
———————————————
prompt = "напиши очень кратко что нужно раскрыть, написать в данном реферате (" + text + ") основываясь на данной структуре (" + ll2 + ") так чтобы реферат был содержательным и взаимосвязанным напиши только 15 ключевых аспектов"
———————————————
prompt = "напиши очень кратко что нужно раскрыть, написать в данном реферате (" + text + ll2 +") так чтобы реферат был содержательным и взаимосвязанным напиши только 15 ключевых аспектов"
———————————————




#1—й кери вопрос ( 1я глава (введение, цели))
——————————
promt = "‘Расскажи по подробнее про данную част реферата (‘ + ll3q1  + ‘) ,твой ответ должен быть максимально развёрнутым и раскрывать всю суть , начни свой ответ с введения  ,то есть ты должен вводить нас в тему(‘ + text + ‘) Введение должно объяснять актуальность данной темы и направить нас к целям и задачам нашего реферата."
——————————
promt = ""Пожалуйста, дайте более детальное описание выбранного аспекта реферата, связанного с (' + ll3q1 + '). Ваш ответ должен быть максимально исчерпывающим и раскрывать всю суть этой части. Пожалуйста, начните свой ответ с введения, чтобы ознакомить нас с основной темой (' + text + '). Введение должно объяснить актуальность данной темы и направить нас к целям и задачам нашего реферата.""
——————————
promt = ""
——————————
promt = ""
——————————
prompt2 = "дай более детальное описание выбранного аспекта реферата, связанного с (" + ll3q1 + ").Твой ответ должен быть максимально исчерпывающим и раскрывать всю суть этой части. Начни свой ответ с введения, чтобы ознакомить нас с основой (" + ww_vars[0] + ww_vars[3] + ww_vars[6] + ww_vars[9] + ww_vars[12] + ww_vars[15] + ") данного реферата (" + text + "). Введение должно объяснить актуальность данной темы и направить нас к целям и задачам нашего реферата."
——————————


#6—й кери вопрос ( 6я глава (заключение, подведение итогов))
——————————
promt = "‘Расскажи по подробнее про данную част реферата (‘ + ll3q1  + ‘) ,твой ответ должен быть максимально развёрнутым и раскрывать всю суть , закончи свой ответ заключением ,то есть ты должен подвести итоги ко всей теме (‘ + text + ‘) Заключение должно подводить итоги и делать выводы и давать рекомендации’"
——————————
promt = ""
——————————
prompt2 ="Расскажи по подробнее про данную част реферата (" + ll5q1 + ") ,твой ответ должен быть максимально развёрнутым и раскрывать всю суть , закончи свой ответ заключением, в нём ты должен подвести итоги всего реферата (" + text + ") состоящего из (" + ww_vars[0] + ww_vars[3] + ww_vars[6] + ww_vars[9] + ww_vars[12] + ww_vars[15] + ") Заключение должно подводить итоги и делать выводы и давать рекомендации"
——————————
prompt2 ="Расскажи по подробнее про данную част реферата (" + ll5q1 + ") ,твой ответ должен быть максимально развёрнутым и раскрывать всю суть , закончи свой ответ заключением по всей теме , в нём ты должен подвести итоги всего реферата (" + text + ") состоящего из (" + ww_vars[0] + ww_vars[3] + ww_vars[6] + ww_vars[9] + ww_vars[12] + ww_vars[15] + ") Заключение должно подводить итоги и делать выводы"
——————————


































